In [37]:
import numpy as np
import pandas as pd

Задание **4.1**

In [251]:
df = pd.DataFrame({
    'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
    'population': [17.04, 143.5, 9.5, 45.5],
    'square': [2724902, 17125191, 207600, 603628]})

df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

1. Создайте новые столбцы, которые будут содержать коды страны: 'KZ', 'RU', 'BY', 'UA'

In [252]:
df['Сountry Сode'] = [ 'KZ', 'RU', 'BY', 'UA']
df

      country  population    square Сountry Сode
0  Kazakhstan       17.04   2724902           KZ
1      Russia      143.50  17125191           RU
2     Belarus        9.50    207600           BY
3     Ukraine       45.50    603628           UA

2. Создайте новые столбцы, которые будут содержать Плотность населения = население (в миллионах) поделить на площадь страны

In [253]:
df['Average Density']=df['population']/df['square']
df

      country  population    square Сountry Сode  Average Density
0  Kazakhstan       17.04   2724902           KZ         0.000006
1      Russia      143.50  17125191           RU         0.000008
2     Belarus        9.50    207600           BY         0.000046
3     Ukraine       45.50    603628           UA         0.000075

3. Добавьте в датафрейм данные еще о двух странах:

USA; 329,5; 9834
United Kingdom; 55,98; 130279

In [254]:

df1 = pd.DataFrame([['USA', 329.5, 9834, 'US'], ['United Kingdom', 55.98, 130279, 'UK']], columns=['country','population',	'square',	'Сountry Сode'])
df = pd.concat([df, df1], ignore_index=True)
df

          country  population    square Сountry Сode  Average Density
0      Kazakhstan       17.04   2724902           KZ         0.000006
1          Russia      143.50  17125191           RU         0.000008
2         Belarus        9.50    207600           BY         0.000046
3         Ukraine       45.50    603628           UA         0.000075
4             USA      329.50      9834           US              NaN
5  United Kingdom       55.98    130279           UK              NaN

4. Найдите среднюю площадь всех стран

In [255]:
df['square'].mean()

3466905.6666666665

Номер 1

In [256]:
r = np.random.RandomState(1)
s = pd.Series(r.uniform(0, 10, 100))
s = pd.Series(sorted(s))
s = (s[s>5])
print('Индекс первого элемента отсортированного s, где значения больше 5:   ', s.index[0])

Индекс первого элемента отсортированного s, где значения больше 5:    51

Номер 2 (Вариант номер 1, выводит целиком данные о человеке)

In [257]:
df = pd.DataFrame({
    'имя': ['Петя', 'Вася', 'Аня', 'Света'],
    'возраст': [45, 26, 41 , 21],
    'доход': [100000, 80000, 150000, 60000],
    'надежность клиента (0..1)': [0.65, 0.74, 0.87, 0.68],
    'пол': ['муж', 'муж', 'жен', 'жен']},
    index=[0, 1, 2, 3])

print("Все, кто старше 40:\n", df[df['возраст']>40])
print("\nВсе, кто имеет доход выше среднего по датасету:\n",df[df['доход']>df['доход'].mean()])
print("\nВсе, кто имеет доход выше среднего по датасету, но надежность ниже среднего по датасету:\n",df[(df['доход']>df['доход'].mean()) & (df['надежность клиента (0..1)']<df['надежность клиента (0..1)'].mean())])
df['важность клиента'] = df['доход']*df['надежность клиента (0..1)']
df['возможная долгосрочность клиента'] = df['важность клиента'] * (df['возраст'].mean() - df['возраст'])
df

Все, кто старше 40:
     имя  возраст   доход  надежность клиента (0..1)  пол
0  Петя       45  100000                       0.65  муж
2   Аня       41  150000                       0.87  жен

Все, кто имеет доход выше среднего по датасету:
     имя  возраст   доход  надежность клиента (0..1)  пол
0  Петя       45  100000                       0.65  муж
2   Аня       41  150000                       0.87  жен

Все, кто имеет доход выше среднего по датасету, но надежность ниже среднего по датасету:
     имя  возраст   доход  надежность клиента (0..1)  пол
0  Петя       45  100000                       0.65  муж

     имя  возраст  ...  важность клиента  возможная долгосрочность клиента
0   Петя       45  ...           65000.0                         -763750.0
1   Вася       26  ...           59200.0                          429200.0
2    Аня       41  ...          130500.0                        -1011375.0
3  Света       21  ...           40800.0                          499800.0

[4 rows x 7 columns]

Номер 2 (Вариант номер 2, выводит только имена)

In [258]:
df = pd.DataFrame({
    'имя': ['Петя', 'Вася', 'Аня', 'Света'],
    'возраст': [45, 26, 41 , 21],
    'доход': [100000, 80000, 150000, 60000],
    'надежность клиента (0..1)': [0.65, 0.74, 0.87, 0.68],
    'пол': ['муж', 'муж', 'жен', 'жен']},
    index=[0, 1, 2, 3])

print("Все, кто старше 40:", *list(df[df['возраст']>40]['имя']), sep=' ')
print("Все, кто имеет доход выше среднего по датасету:",*list(df[df['доход']>df['доход'].mean()]['имя']), sep=' ')
print("Все, кто имеет доход выше среднего по датасету, но надежность ниже среднего по датасету:",*list(df[(df['доход']>df['доход'].mean()) & (df['надежность клиента (0..1)']<df['надежность клиента (0..1)'].mean())]['имя']), sep=' ')
df['важность клиента'] = df['доход']*df['надежность клиента (0..1)']
df['возможная долгосрочность клиента'] = df['важность клиента'] * (df['возраст'].mean() - df['возраст'])
df

Все, кто старше 40: Петя Аня
Все, кто имеет доход выше среднего по датасету: Петя Аня
Все, кто имеет доход выше среднего по датасету, но надежность ниже среднего по датасету: Петя

     имя  возраст  ...  важность клиента  возможная долгосрочность клиента
0   Петя       45  ...           65000.0                         -763750.0
1   Вася       26  ...           59200.0                          429200.0
2    Аня       41  ...          130500.0                        -1011375.0
3  Света       21  ...           40800.0                          499800.0

[4 rows x 7 columns]

Номер 3

In [259]:
#df2.rename(columns={'frukt': 'fruit', 'ves': 'weight', 'price': 'price'}, inplace='True')
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})

df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

df = []
for i in range(len(df1)):
  for j in range(len(df2)):
    if df2['frukt'][j]==df1['fruit'][i] and df2['ves'][j]==df1['weight'][i]:
      df.append([df1['fruit'][i],df1['weight'][i]])
df = pd.DataFrame(df, columns={'fruit', 'weight'})
df

  weight fruit
0  apple   low
1  apple   low
2  apple   low